In [4]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [7]:
data_dic = {
    'col_1':[1,2,3,4,5],
    'col_2':[111,222,333,111,555],
    'col_3':['alpha','bravo','charlie', np.nan,np.nan]
}
df = pd.DataFrame(data_dic)
df

   col_1  col_2    col_3
0      1    111    alpha
1      2    222    bravo
2      3    333  charlie
3      4    111      NaN
4      5    555      NaN

In [10]:
df['col_2'].unique()

array([111, 222, 333, 555])

In [11]:
df['col_2'].nunique()

4

In [12]:
df.nunique()

col_1    5
col_2    4
col_3    3
dtype: int64

In [13]:
df['col_2'].value_counts()

col_2
111    2
222    1
333    1
555    1
Name: count, dtype: int64

In [17]:
df.sort_values(by='col_2',ascending=False)

   col_1  col_2    col_3
4      5    555      NaN
2      3    333  charlie
1      2    222    bravo
0      1    111    alpha
3      4    111      NaN

In [20]:
df.sort_values(by=['col_2','col_1'],ascending=False)

   col_1  col_2    col_3
4      5    555      NaN
2      3    333  charlie
1      2    222    bravo
3      4    111      NaN
0      1    111    alpha

In [21]:
def square(value):
    return value * value

In [22]:
square(3)

9

In [23]:
df['col_1'].apply(square)

0     1
1     4
2     9
3    16
4    25
Name: col_1, dtype: int64

In [24]:
df['col_1'].apply(lambda value:value*value)

0     1
1     4
2     9
3    16
4    25
Name: col_1, dtype: int64

In [25]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [27]:
df.columns

Index(['col_1', 'col_2', 'col_3'], dtype='object')

In [28]:
del df['col_1']

In [29]:
df

   col_2    col_3
0    111    alpha
1    222    bravo
2    333  charlie
3    111      NaN
4    555      NaN

In [31]:
data = pd.read_csv('City_of_Chicago_Payroll_Data.csv')
data

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,"$107,790.00",NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,"$104,628.00",NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,"$114,324.00",NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,"$76,932.00",NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,"$111,474.00",NaN
...,...,...,...,...,...,...,...,...
32653,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,F,Salary,NaN,"$90,024.00",NaN
32654,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,"$48,078.00",NaN
32655,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,"$87,006.00",NaN
32656,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,"$93,354.00",NaN
32657,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,"$115,932.00",NaN

In [34]:
data.groupby('Department')[['Name']].count().idxmax()

Name    POLICE
dtype: object

In [35]:
data.groupby('Department')[['Name']].count().sort_values(by='Name',ascending=False).head(1)

             Name
Department
POLICE      12973

In [40]:
data['Salary'] = data['Annual Salary'].str.replace('$','').str.replace(',','').astype(float)
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32658 entries, 0 to 32657
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               32658 non-null  object
 1   Job Titles         32658 non-null  object
 2   Department         32658 non-null  object
 3   Full or Part-Time  32658 non-null  object
 4   Salary or Hourly   32658 non-null  object
 5   Typical Hours      7883 non-null   float64
 6   Annual Salary      24775 non-null  object
 7   Hourly Rate        7883 non-null   object
 8   Salary             24775 non-null  float64
dtypes: float64(2), object(7)
memory usage: 2.2+ MB